app/Http/Controllers/JournalsController.php

    private function checkJournal($slug)
    {
        return Journals::where("slug", $slug)->first();
---
select * from `journals` where `slug` = 'المؤتمر-الدولي-السنوي-الرابع-لمركز-المولى-إسماعيل-للدراسات-والأبحاث-في-اللغة-والآداب-والفنون--في-موضوع:-\"-اللسانيات-والعلوم-قضايا-التجسير--وآفاق-الامتداد-والاستثمار\"' limit 1

    public function team($slug)
    {
        $row = $this->checkJournal($slug);
        if (empty($row)) {
            return redirect('journals');
        }
        $team = Team::where("journal_id", $row->id)->orderBy('id', 'DESC')->get();
---
select * from `team` where `journal_id` = 21 order by `id` desc