app/Http/Controllers/JournalsResearchesController.php

    public function researches(JournalsResearches $research_db, $slug, $version_id)
    {
        $pageTitle = '';
        $row = Versions::where('id', $version_id)->first();
        if (empty($row)) {
            return redirect('');
        }
        if ($row->old_version != null) {
            $pageTitle = $row->old_version . ' من ' . unSlug($slug);
        } else {
            $month = (int)($row->month) ;
            if($month != 0){
                $month =  (int)($row->month) - 1 ;
            }
            $pageTitle = "الإصدار " . $row->version . ' : ' . $row->day . ' ' . $this->months[$month] . ' ' . $row->year . ' ' . ' من ' . unSlug($slug);
        }
        $query = null;
        $where = null;
        $equal = '=';
        if (isset($_GET['search'])) {
            $query = "%" . trim($_GET['search']) . "%";
            $where = 'title';
            $equal = 'like';
        }
        $researches = DB::table($research_db->table)->where("version_id", $version_id)->where($where, $equal, $query)->orderBy('id', 'ASC')->get();
        $journals = Journals::orderBy("id", "DESC")->limit(6)->select('name', 'slug', 'cover')->get();
        $services = Services::orderBy("id", "DESC")->get();
---
select * from `versions` where `id` = '73' limit 1
select `name`, `slug`, `cover` from `journals` order by `id` desc limit 6
select * from `services` order by `id` desc

    public function show($slug)
    {
        $row = JournalsResearches::with(["journal" => function ($q) {
            $q->select('id', 'name');
        }, "version"])->where('slug', $slug)->first();
        if (empty($row)) {
            return redirect('');
        }
        $pageTitle = $row->title;
        $journals = Journals::orderBy("id", "DESC")->limit(3)->select('name', 'slug', 'cover', 'meta_desc')->get();
        $services = Services::orderBy("id", "DESC")->get();
---
select * from `versions` where `versions`.`id` in (117)
select `id`, `name` from `journals` where `journals`.`id` in (8)
select `name`, `slug`, `cover`, `meta_desc` from `journals` order by `id` desc limit 3
select * from `services` order by `id` desc